app/views/pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
        <% for @p in @posts %>
        <% userName = User.find(@p.user_id).username %>